fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ЕжемесячнаяАбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ГруппаАбонентскоеОбслуживание = Элементы.Добавить("ВКМ_ГруппаАбонентскоеОбслуживание", Тип("ГруппаФормы"));
    ГруппаАбонентскоеОбслуживание.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаАбонентскоеОбслуживание.ОтображатьЗаголовок = ИСТИНА;
    ГруппаАбонентскоеОбслуживание.Заголовок = "Абонентское обслуживание";
   	ГруппаАбонентскоеОбслуживание.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
        
    ГруппаПериод = Элементы.Добавить("ВКМ_ГруппаПериод", Тип("ГруппаФормы"), ГруппаАбонентскоеОбслуживание);
    ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаПериод.ОтображатьЗаголовок = ЛОЖЬ;
    ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
     
    ГруппаСуммы = Элементы.Добавить("ВКМ_ГруппаСуммы", Тип("ГруппаФормы"), ГруппаАбонентскоеОбслуживание);
    ГруппаСуммы.Вид = ВидГруппыФормы.ОбычнаяГруппа;
    ГруппаСуммы.ОтображатьЗаголовок = ЛОЖЬ;
    ГруппаСуммы.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
    
    ДатаНачала = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"), ГруппаПериод);
    ДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
    ДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
     
    ДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), ГруппаПериод);
    ДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
    ДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
    
    АбонентскаяПлата = Элементы.Добавить("ВКМ_ЕжемесячнаяАбонентскаяПлата", Тип("ПолеФормы"), ГруппаСуммы);
    АбонентскаяПлата.Вид = ВидПоляФормы.ПолеВвода;
    АбонентскаяПлата.ПутьКДанным = "Объект.ВКМ_ЕжемесячнаяАбонентскаяПлата";
     
    СтоимостьЧаса = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаСуммы);
    СтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
    СтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";	
	
	ВКМ_ОбновитьВидимостьАбонентскихРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_ОбновитьВидимостьАбонентскихРеквизитов();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ОбновитьВидимостьАбонентскихРеквизитов()
    Элементы.ВКМ_ГруппаАбонентскоеОбслуживание.Видимость = (Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
КонецПроцедуры

#КонецОбласти
